In [1]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [2]:
pd.DataFrame({'A': [1,2], 'B': [3,4],'C': [5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [3]:
pd.DataFrame([
    [1,2,3],
    [4,5,6]],
    index=[1,2],
    columns=['A','B','C'])

   A  B  C
1  1  2  3
2  4  5  6

In [4]:
pd.DataFrame([
    [1,2,3],
    [4,5,6],
    [7,8,9],
    [10,11,12]],
    index=range(1,5),
    columns=['A','B','C'])

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [5]:
pd.Series({'한국': "서울", "일본": "도쿄", "중국": "베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [6]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  85  15  64
1  34  14  87

In [7]:
pd.DataFrame({'a': [1,2],'b':[1,2]}, index=[1,2])

   a  b
1  1  1
2  2  2

In [76]:
''.join(random.choice(string.ascii_letters) for i in range(5))

SyntaxError: invalid syntax (<ipython-input-76-61d819b599bd>, line 1)

In [73]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [74]:
id()

'XebzQ'

In [13]:
def score():
    return np.random.randint(0, 100)

In [16]:
score()

22

In [82]:
pd.DataFrame({'국어': [score() for i in range(5)] , '영어': [score() for i in range(5)],
              '수학': [score() for i in range(5)],'사회': [score() for i in range(5)]}, 
             index=[id() for i in range(5)])

       국어  영어  수학  사회
lHNRF  61  30  33  15
agxPB  21  25  25  22
OUBpz  38  88  74  51
GPPYj  61  21  25  43
WQsWJ  14  28  32  43

In [80]:
pd.DataFrame([[score() for i in range(4)],
              [score() for i in range(4)],
              [score() for i in range(4)],
              [score() for i in range(4)],
              [score() for i in range(4)] ],
            index = [id() for i in range(5)],
            columns = ['국어', '영어', '수학', '사회'])

       국어  영어  수학  사회
eTEOK  82  69  21  15
VzdXu  36  35  34  66
cCyXD  74  83  64   4
YKryb  47  83  85  32
dlOlw   0  41  64  46

In [83]:
pd.DataFrame(np.random.randint(0, 100, size=(10, 4)),
             index=list((''.join(random.choice(string.ascii_letters) for i in range(5))) for i in range(10)),
             columns=['국어', '영어', '수학', '사회']
            )

       국어  영어  수학  사회
hdmlx  41  57  71   3
RRYyU  15  86  64  19
zRrLq   4  61   5   7
ucrJc  18  42  84  72
cKzRO  34  95   6  37
ynoEM  50  59  16   5
iTscg  19  51  26  89
kZJfD  48  42  96  76
iKWat  73  32  11  30
rzPrM  51  82  84   0

In [84]:
df = pd.DataFrame({"국어":score(), "영어":score(), "수학":score(), "사회":score()}, index=[id()])
for i in range(1,10):
    df.loc[id()] = {"국어":score(), "영어":score(), "수학":score(), "사회":score()}
df

       국어  영어  수학  사회
Svpqb  23  74  42  81
jMkWE  20  26  29  51
CbAAb  80  46  61   4
QUbXy  58  55  59  54
pWPlh  40  18   0  24
upJIS  94  99   9  53
TvEDZ  95   0  20   9
frrEw   7  48  22  97
CawXW  52  30  53  86
vEhBd   7  15  20  31